Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: This section of the Targets window permits you to have GameMaker Studio 2 automatically select a specific configuration for a specific target platform.
zh_cn: “目标”窗口的此部分允许您让 GameMaker Studio 2 自动为特定目标平台选择特定配置。

source: This section will show the Master runtime feed URL by default, but you can click the Add button to create a new Runtime Feed where you give the name and the URL for the RSS feed, and then click Apply to tell GameMaker Studio 2 to access it.
zh_cn: 默认此部分将显示主要的运行库下载源地址，但是你可以点击添加按钮创建一个新的运行库下载源，你可以在其它给出RSS源的名称和网址，然后点击应用告知GameMaker Studio 2 访问它。

source: This setting controls how far you have to drag the tab before the workspace recognises it, and the default value is 4px.
zh_cn: 该选项控制着在工作区识别出该操作之前你需要将标签页拖拽出多远，默认值为4px。

source: This setting controls how far you have to drag the tab before the workspace recognises it, and the default value is 50px.
zh_cn: 此设置控制在工作区识别之前拖拽选项卡的距离，默认值为50像素。

source: This setting is on by default, and un-checking it will switch it off (meaning that you will have to manually remove any temp files later).
zh_cn: 该选项默认为开，解除勾选此项会将其关闭（意味着你需要在以后手动地删除所有的临时文件）。

source: This setting sets the number of milliseconds to have to wait with the mouse button pressed before the node can be moved (not repositioned).
zh_cn: 这个设定设置了在节点能够被移动之前需要等待鼠标按下的毫秒数（不重置）。

source: This setting will affect how much an object "bounces" when it collides with other objects and is co-dependant on other forces that act on the instance like gravity and friction.
zh_cn: 此设置将影响对象在与其他对象碰撞时“弹跳”多少，并且与重力和摩擦力作用于实例上的其他力相配合。

source: This setting will be used to define the maximum permitted size (default 64px).
zh_cn: 这项设定将被用于定义允许的最大尺寸（默认为64像素）。

source: This setting will be used to define the minimum permitted size (default 16px).
zh_cn: 这项设定将被用于定义允许的最小尺寸（默认为16像素。）

source: This sharing is called "inheritance" and an object that has a parent is called a "child" object.
zh_cn: 这种共享称为“继承”，具有父类的对象称为“子”对象。

source: This simple code will initialize a ten position array (0-9) to 0, in that each position in the array contains the value 0.
zh_cn: 这个简单的代码将初始化十个位置的数组（0-9）为0，数组的每个位置储存的数值都是0。

source: This simply means that you can tell your game to run the current line of code, then step onto the next one, permitting you to run through your entire game one line of code at a time should you wish.
zh_cn: 这意味着你可以告诉你的游戏运行代码中的当前行，之后跳转到下一行。只要你想，就允许你跨越整个游戏来运行一行代码。

source: This sprite is a tile set and resizing will cause tile data to change.
zh_cn: 这个精灵是一个图块集，重定义大小将导致图块数据变化。

source: This sprite is used by multiple tile sets of varying tile sizes.
zh_cn: 这个精灵被不同大小的多个图块集所使用。

source: This starts the game again after it has been paused
zh_cn: 在游戏被暂停后再次开始游戏

source: This stretches the game window to accommodate both ports and uses the window colour to colour the background where no view is shown.
zh_cn: 拉伸游戏窗口容纳两个视野输出，并用窗口颜色填充没有视野画面的区域。

source: This then permits you to manipulate in real time the position, colour, and alpha values that are actually rendered into the display buffer.
zh_cn: 这样就允许你实时操作渲染到显示缓冲区的位置，颜色和 alpha 信息。

source: This time line has no moments with source code
zh_cn: 该时间轴没有带有源代码的时刻

source: This type of information being provided by the error reporting is very important as it detects and reports the syntax and language related bugs that are going to cause your finished game to crash, but it won't report more subtle bugs, nor does it give feedback on performance.
zh_cn: 错误报告提供的信息非常重要，因为它会检测并报告导致游戏崩溃的语法和语言相关的错误，但不会报告更多的细微错误，也不会给出修复反馈。

source: This value is not clamped to the game speed of your game, and so shows you how much "overhead" you have to play with.
zh_cn: 这个值 不 能完全决定游戏的游戏速度，而是显示当你游玩时还有多少性能剩余。

source: This variable has been inherited from the parent object {0}.
zh_cn: 此变量已从父物体{0}继承。

source: This variable will return a value based on the setting of bits for the different levels.
zh_cn: 这个变量基于不同等级设置的比特值返回一个值。

source: This watch enables you to see exactly what is being drawn to any surfaces you have in your game (including the application surface) as well as see the texture pages that are in memory.
zh_cn: 在此视图中允许你查看到底哪些东西正画在你的表面上（包括应用表面）以及查看内存中的材质页。

source: This watch shows you all the information available for the state of the current frame being rendered, like the draw alpha or fill colour.
zh_cn: 这个窗口为你显示所有被渲染当前帧的可用信息，例如绘制的透明度或者填充颜色。

source: This will actually compile down to just "a & 11111111111111111111111111111010".
zh_cn: 这将实际编译为 "a & 11111111111111111111111111111010"。

source: This will also show any debug messages that you choose to send from your project at runtime, and can be configured to show different quantities of information from the General Preferences.
zh_cn: 除此之外还将显示您选择在运行库从项目发送的所有调试消息，并且可以从 常规首选项 设置显示不同数量的信息。

source: This will be on by default but can be switched off if you prefer by toggling this button.
zh_cn: 这个属性默认是开着的但是你也可以根据你的喜好把这个按钮切换为关闭状态。

source: This will bring up the following window:
zh_cn: 这将弹出如下图窗口：

source: This will clear the screen with the colour blue.
zh_cn: 这将用蓝色填充整个屏幕。

source: This will close the debugger and permanently discard all collected data.
zh_cn: 这会关闭调试器并永久丢弃所有已收集的数据。

source: This will close the game and the debugger and permanently discard all collected data.
zh_cn: 这会关闭游戏并永久丢弃所有已收集的数据。

source: This will create a bare (server) repository and bind your project to it
zh_cn: 这将创建一个公开（服务器）存储库并将项目绑定到它

source: This will create a new DnD™ script and open the editor window:
zh_cn: 就会创建一个新的DnD™脚本并打开编辑器窗口：

source: This will create a new particle emitter and store its index in the variable "p_emit".
zh_cn: 这段代码会新建一个粒子发射器并将其索引存入变量“p_emit”中。

source: This will create a new sprite and open the sprite editor for you (if the sprite editor does not open, simply double-click on the new resource):
zh_cn: IDE 将会创建一个新的精灵并为你打开精灵编辑器（如果精灵编辑器没有打开，只需双击 新资源就可打开）：

source: This will create a new view of the resource tree cloned from the previously selected view.
zh_cn: 这将创建从先前选择的视图克隆来的资源树新视图。

source: This will create a new view of the resource tree with no resources added to it (ie: a blank view).
zh_cn: 这将创建资源树的新视图，且不添加任何资源（即空白视图）。

source: This will free up the memory associated with all the entries and values for that array.
zh_cn: 这会释放数组所有数据关联的内存。

source: This will give very detailed information on how a game is performing and how long it takes to perform specific function calls or events (see the section on The Debug Module for further details).
zh_cn: 它将提供有关游戏运行情况以及执行特定功能调用或事件所需要时间的非常详细的信息（有关详细信息，请参阅 调试模块 一节）。

source: This will have a direct impact on how much inertia a fixture has as well as how it reacts to collisions and forces, so if you make a small shape with a high density it will have a very large mass (like a bar of lead), but if you define a large shape with a low density it will have a much smaller mass (like a balloon).
zh_cn: 这将直接影响夹具具有多少惯性以及如何对碰撞和力产生反应，因此，如果您制造出高密度的小形状，则会产生非常大的质量（如铅棒）但是如果您定义了一个较小密度的大形状，那么它的质量会更小（像一个气球）。

source: This will lose any unapplied changes you have made - do you want to continue?
zh_cn: 这将会丢失所有未应用的更改 - 你想要继续吗？

source: This will now create a file called "debug.txt" in the same location as the executable (not the shortcut location, but where the game is installed) with debug and compiler information from your finished game.
zh_cn: 这将在可执行文件的位置（不是快捷方式位置，而是游戏安装位置）创建一个名为 “debug.txt” 的文件，它带有来自于你完成的游戏的调试和编译信息。

source: This will open the Asset Explorer where you can select the sprite to use:
zh_cn: 这将会打开 资源管理器，您可以在其中选择要使用的精灵：

source: This will open the Tile Set Editor where you can then add the sprite and set its properties:
zh_cn: 之后会打开 图块集编辑器，然后添加精灵并设置其属性：

source: This will open the following window for you to fill in:
zh_cn: 这将打开以下窗口，供你填写：

source: This will open the window pictured at the top of this page with the following sections:
zh_cn: 这将打开此页面顶部的窗口，具有以下部分：

source: This will prompt you to choose another event category and once selected the contents of the current event will be changed to the new event (removing the original event in the process).
zh_cn: 这将提示您选择另一个事件类别，一旦选择了当前事件的内容将被更改为新事件（删除过程中的原始事件）。

source: This will re-open any windows that are related to a tutorial project you have opened, but only if the project is one that was created as part of a tutorial (if not, this option will be unavailable).
zh_cn: 该选项将会重新打开任何与你所打开的教程项目有关的窗口，但是，前提是该项目必须已经创建为教程的一部分（否则该选项不可用）。

source: This will reset the focused workspace to be 1:1 again.
zh_cn: 重新设置聚焦工作区为1：1比例。

source: This will return TRUE if argument0 is a power of 2.
zh_cn: 如果 argument0（参数0）是 2 的幂，那么将返回 TRUE。

source: This will return the colour of the pixel at coordinates (56,78) of the surface indexed in the variable "surf".
zh_cn: 这将返回索引为“surf”的表面在在坐标（56,78）位置的像素的颜色。

source: This will run the game, but also open up the Debug Window, where you can monitor how your game performs and debug any issues (see the section on Debugging for more information).
zh_cn: 这将会运行游戏，并打开 调试窗口，您可以在其中监视游戏的运行情况和调试其中的问题（有关详细信息，请参阅 调试 部分）。

source: This will set a timer to "push" a notification to the device when one day has passed.
zh_cn: 设置一个定时器在一天后向设备“推送”一个通知。

source: This will set the GUI layer to have a 1:1 scale again and set the draw position to the (0,0) position of the application surface rather than the display or window.
zh_cn: 这个操作会再次设置以1:1的比例，(0,0)的位置，相对于应用表面层作出改变，而不是显示器或窗口。

source: This will set the active drawing font to fnt_Main if it exists.
zh_cn: 这段代码在fnt_Main字体存在时将其设置为活动字体。

source: This will take the contents of the chosen event and duplicate them in another event that you specify.
zh_cn: 这将取代所选事件的内容，并在您指定的另一个事件中复制它们。

source: This will then update the rest of the options windows to show different details depending on the platform selected.
zh_cn: 然后剩余的选项窗口将会更新以显示不同的细节，具体内容取决于所选的平台。

source: This will toggle all the docked elements between hidden and unhidden.
zh_cn: 切换所有已停靠的窗口的状态（隐藏和显示）。

source: This will toggle laptop mode on and off (This will only appear if you are currently using a laptop - see the section on IDE Input for more details)
zh_cn: 打开和关闭笔记本电脑模式（使用笔记本电脑时才会显示） - 有关详细信息，请参阅 IDE输入部分 。

source: This will zoom the focused workspace in to make everything larger (you can also achieve this holding down / and using the mouse wheel ).
zh_cn: 缩放聚焦的工作空间，使所有内容变大（您也可以通过按住 / 并使用鼠标滚轮 来实现）。

source: This will zoom the focused workspace out to make everything smaller (you can also achieve this holding down / and using the mouse wheel ).
zh_cn: 缩放聚焦的工作空间，使所有内容变小（您也可以通过按住 / 并使用鼠标滚轮 来实现）。

source: This window is for when you select an instance from your game.
zh_cn: 这个窗口是为了你在游戏中选择的实例而存在的。

source: This window is for you to add a specific variable that you want to keep track of.
zh_cn: 这个窗口可以让你添加你想一直追踪的特定的变量。

source: This window is where you can see the current system profile for the game being tested where you can check everything in your game from whole events to individual function calls to see how they are performing and spot any trouble areas or bottlenecks.
zh_cn: 该窗口是你查看当前被测试游戏所处系统概况的地方，在此处你能查看你游戏中从整个事件到单独的函数调用中的各种细节，以此了解程序如何表现它们的功能，而麻烦区域或者瓶颈又在哪里。

source: This window permits you to change those properties and edit how the layer will be rendered.
zh_cn: 此窗口允许您更改这些属性并编辑层的渲染方式。

source: This window permits you to see a list of every resource in your game and you can type in text at the top of the window to filter the results shown.
zh_cn: 此窗口允许您查看游戏中所有资源组成的列表，您可以在窗口顶部输入文本，以过滤显示的结果。

source: This window simply shows the output of the compiler (as shown in the main IDE compiler window).
zh_cn: 这个窗口仅仅会显示编译器的输出（正如主IDE编译器窗口中显示的一样）。

source: This window will display the current call stack of events, as well as the line number for the code being stepped through.
zh_cn: 这个窗口会显示当前事件的调用栈，还有按步跳过代码的行号。

source: This wizard helps you easily create a layout for your DnD™ action.
zh_cn: 该向导可帮助您轻松为DnD™动作创建布局。

source: This won't be necessary if you clone the default view, since all current resources will be in it to start with, but if you use a blank view or use the Delete right mouse button option to remove the item from the new view, you will need to re-add it again later if required.
zh_cn: 如果您选择克隆默认视图，则所有这些操作都不是必需的，因为所有当前资源都将被复制在其中，但是如果您使用空白视图或使用鼠标右键的删除选项从新视图中 删除 该项目，那么当需要该资源时，你需要重新添加。

source: This work around for those bad drivers will slow things down, giving a noticeable performance hit for your game, so if you do not need the fix do not use it.
zh_cn: 对于那些糟糕的驱动，使用该选项会减慢游戏速度，带来显著的性能下降，如果你不需要修复，就不要使用该选项。

source: This works as follows:
zh_cn: 工作流程如下：

source: This would add "." to all the strings held in the cells within the defined region of the ds_grid referenced by the variable "grid".
zh_cn: 这将会向索引为变量"grid"的栅格结构中确定区域内的单元格中的所有字符串叠加一个"."。

source: This would add 2 to all the values held in the cells within the defined disk area of the ds_grid referenced by the variable "grid".
zh_cn: 这将会向索引为变量"grid"的栅格结构中确定圆盘区域内的单元格中的所有值叠加2。

source: This would add 6 to the given cell within the ds_grid referenced by the variable "grid".
zh_cn: 这将会向索引为变量"grid"的栅格结构中被给定的单元格叠加6.

source: This would be a binary "mask" of 11111111111111111111111111111010 (32bits).
zh_cn: 这里需要一个二进制掩码 “11111111111111111111111111111010（32位）”。

source: This would call User Defined Event 4.
zh_cn: 这段代码会调用用户定义事件4。

source: This would require a left shift of 4 bits, or 7 bits respectively.
zh_cn: 这分别需要向左移动 4 位或 7 位。

source: This would set my_x to the x coordinate of the mouse relative to the display.
zh_cn: 上述将设置 my_x 等于相对于显示器的鼠标x坐标。

source: This would set my_y to the y coordinate of the mouse relative to the display.
zh_cn: 上述将设置 my_y 为屏幕上的鼠标的y坐标。

source: This would set myx to the x coordinate of the mouse in the window relative to all active views.
zh_cn: 这个将设置myx 等于窗口中相对于所有激活视野的鼠标x坐标。

source: This would set myy to the y coordinate of the mouse in the window relative to all active views.
zh_cn: 这个将设置myy 等于窗口中相对于所有激活视野的鼠标y坐标。

source: This would set the variable "dpx" to the dpi value of the x axis.
zh_cn: 设置变量“dpx”等于x轴的dpi值。

source: This would set the variable "dpy" to the dpi value of the y axis.
zh_cn: 设置变量“dpy”等于y轴的dpi值。

source: This would set the variable "myheight" to the display's height.
zh_cn: 设置变量“myheight”为显示器的高度。

source: This would set the variable "mywidth" to the display's width.
zh_cn: 设置变量“mywidth”为显示器的宽度。

source: Threshold
zh_cn: 阈值

source: Thumbnail
zh_cn: 缩略图

source: Thumbnail Slider
zh_cn: 缩略图滑块

source: Tick this to display all values as averages.\nUntick it to display accumulated values.
zh_cn: 勾选此项以将所有值显示为平均值。\n取消勾选以显示累计值。

source: Tile
zh_cn: 图块

source: Tile - The image will be tiled to cover the workspace
zh_cn: 拼贴（Tile） - 图像将会被逐片拼贴到工作区上。

source: Tile Alignment
zh_cn: 图块对齐

source: Tile Animation
zh_cn: 图块动画

source: Tile Data Size
zh_cn: 图块数据大小

source: Tile Editing
zh_cn: 图块编辑

source: Tile Height
zh_cn: 图块高度

source: Tile Horizontally
zh_cn: 水平平铺

source: Tile Horizontally and Tile Vertically relate to how the edges of the image will be\ncreated when placed on the texture page.
zh_cn: 水平平铺或垂直平铺关系到图像放置在纹理页中时如何创建边缘。

source: Tile Layer Editor
zh_cn: 图块层编辑器

source: Tile Offset X
zh_cn: 图块偏移 X

source: Tile Offset Y
zh_cn: 图块偏移 Y

source: Tile Properties
zh_cn: 图块属性

source: Tile Selection Window
zh_cn: 图块选择窗口

source: Tile Separation X
zh_cn: 图块间隔 X

source: Tile Separation Y
zh_cn: 图块间隔 Y

source: Tile Set
zh_cn: 图块集

source: Tile Set Editor
zh_cn: 图块集编辑器（Tile Set Editor）

source: Tile Set Icon
zh_cn: 图块集图标

source: Tile Set Properties
zh_cn: 图块集属性

source: Tile Set Resource
zh_cn: 图块集资源

source: Tile Set Sprite
zh_cn: 图块集精灵

source: Tile Set: Image generated for '{0}'
zh_cn: 图块集：为“{0}”生成的图像

source: Tile Set: {0}
zh_cn: 图块集：{0}

source: Tile Sets
zh_cn: 图块集

source: Tile Sets Editor
zh_cn: 图块集编辑器

source: Tile Sets Label Colour
zh_cn: 图块集标签颜色

source: Tile Sets background colour
zh_cn: 图块集背景颜色

source: Tile Sets icon colour
zh_cn: 图块集图标颜色

source: Tile Size
zh_cn: 图块大小

source: Tile Vertically
zh_cn: 垂直平铺

source: Tile Width
zh_cn: 图块宽度

source: Tile map coordinate: ({0}, {1})
zh_cn: 图块地图坐标： ({0}, {1})

source: Tile map coordinate: ({0}, {1}) Brush tiles: ({2})
zh_cn: 图块地图坐标：({0}, {1}) 笔刷图块：({2})

source: Tile set
zh_cn: 图块集

source: Tile set Editor
zh_cn: 图块集编辑器

source: Tile sets
zh_cn: 图块集

source: Tile sets are taken from the sprite resources, but are classified as a separate resource since GameMaker Studio 2 will handle them differently when creating your game.
zh_cn: 图块集从精灵资源中获取，但是由于 GameMaker Studio 2 在创建游戏时会以不同于精灵的方式编辑图块集，所以它们被单独分类出来。

source: Tile size increase will cause rooms to lose some tile layer data, are you sure you want to make this change?\n\nTo avoid data loss press cancel and increase room size of the affected rooms: {0}
zh_cn: 图块尺寸增加将导致房间丢失一些图块层数据，你确定要进行此更改吗？\n\n为避免数据丢失请按取消，并扩大受影响的房间的大小： {0}

source: Tilemap Layer
zh_cn: 图块映射层

source: Tilemap Name
zh_cn: 图块地图（Tilemap）名称

source: Tiles
zh_cn: 图块

source: Tiles - {0}
zh_cn: 图块 - {0}

source: Tiles can only be rectangular or square (if you want anything other than a this, then you'll need to create a regular sprite and use the Asset Layer in the room editor, which we'll discuss later).
zh_cn: 图块 只能是矩形 或 正方形 （如果你想要其他形状，那么你需要创建一个普通的精灵，并使用房间编辑器中的 资源层 ，相关内容我们将在后面讨论）。

source: Tilesets
zh_cn: 图块集

source: Time (Ms)
zh_cn: 时间 (毫秒)

source: Time In Seconds
zh_cn: 时间（秒）

source: Time in IDE
zh_cn: IDE运行时间

source: Timeline
zh_cn: 时间轴

source: Timeline Editor
zh_cn: 时间轴编辑器

source: Timeline Moments: {0}
zh_cn: 时间轴时刻：{0}

source: Timeline: {0}
zh_cn: 时间轴：{0}

source: Timeline: {0}: moment {1}
zh_cn: 时间轴：{0}: 时刻 {1}

source: Timelines
zh_cn: 时间轴

source: Timelines Label Colour
zh_cn: 时间轴标签颜色

source: Timelines background colour
zh_cn: 时间轴背景颜色

source: Timelines icon colour
zh_cn: 时间轴图标颜色

source: Times
zh_cn: 次数

source: Title
zh_cn: 标题

source: Title Bar
zh_cn: 标题栏

source: Title ID
zh_cn: 标题 ID

source: Title Id
zh_cn: 标题 Id

source: Title for Browser
zh_cn: 浏览器标题

source: To access this surface, you need to use the built-in global variable application_surface which is explained on the following page:
zh_cn: 若要访问这个表面层，你需要用到内置变量application_surface，接下来的章节会进行解释：

source: To achieve this you can make a time line where you start with setting a motion to the left.
zh_cn: 要做到这个，你可以通过创建一个时间轴，在起始时间设置向左运动。

source: To add a bookmark, simply select the window or line of code that you wish to tag and then + + NumberKey[0 - 9], and this will set the bookmark, labelling the item in the IDE as follows:
zh_cn: 要添加书签，只需选择要标记目标窗口或代码行，然后利用组合键 + + 小键盘[0 - 9]来设置书签，并在 IDE 中标记该项目，如下所示：

source: To add an event you click on the Add Event button:
zh_cn: 要添加事件，请单击 添加事件 按钮：

source: To add an instance to a layer, simply click on the object in the resource tree and then drag it into the room editor workspace.
zh_cn: 要将实例添加到层，只需单击 资源树中的物体，然后将其拖入房间编辑器工作区。

source: To add events into the object, you press the Add Event button found at the bottom of the events list which will bring up the following window:
zh_cn: 要将事件添加到对象中，请按事件列表底部的添加事件按钮，弹出以下窗口：

source: To avoid these effects, you can un-check this flag and the instance will be created with the fixture asleep, and it will not participate in the physics simulation unless something acts upon it.
zh_cn: 为了避免这些影响，您可以取消选中此标志，并使用固定装置睡眠创建实例，除非有事情发生，否则它不会参与物理模拟。

source: To avoid this, use the () to separate out the parts, like this:
zh_cn: 为了避免这个问题，可以用圆括号()将各部分分开，如下所示：

source: To begin with, you will only have a single "Local" machine listed here, which is the machine that GameMaker Studio 2 is installed on, but you can also configure a Remote Worker to use.
zh_cn: 首先，您只能在此列出一个单独的“本地”机器，这是安装了 GameMaker Studio 2 的机器，但您也可以配置远程工作人员来使用。

source: To call a script from within a piece of code, just act the same way as when calling functions - that is, write the script name with the argument values in parentheses.
zh_cn: 在一个代码块中调用脚本就像调用函数一样 - 使用脚本的名字，括号内填写参数的值。

source: To change the current target platform you can click on the Targets button to open the Targets Window, which will look something like this (exact details will vary based on your licence type):
zh_cn: 要更改当前的目标平台，您可以点击 目标平台 按钮 打开 目标窗口，如下所示（具体细节根据您的许可证类型而会有所不同）：

source: To clarify this, think of a game made with GameMaker Studio 2.
zh_cn: 为了澄清这一点，想想用 GameMaker Studio 2制作的游戏。

source: To control how the object behaves over time, each game frame is split into a series of events, so you can add code or actions into a specific event and it will only run when the event is triggered, and events can be triggered by things like mouse button presses or collisions with other instances.
zh_cn: 为了更好地控制随时间推移中的物体，每帧游戏内容都会被分割成一系列 事件，所以你可以将代码或动作模块添加到某一个实践中，事件只有在被触发时才会运行，事件可以通过操作鼠标或者与其他实例碰撞来触发。

source: To create a DnD™ script, you simply use the right mouse button on the Script resource and select Create.
zh_cn: 欲创建DnD™脚本，你只需要在脚本资源上右键并选择创建（Create）

source: To create a new object resource, it's the same as for every other resource and you simply right click on the Objects resource folder and selecting Create.
zh_cn: 要创建一个新的物体资源，与其他资源相同，只需右键单击 对象资源文件夹并选择 创建。

source: To create a new project simply click the button labelled New to take you to the following screen:
zh_cn: 要创建一个新的项目，仅需要点击按钮标签新建（New），你将看到下面的屏幕内容：

source: To create an object in your game, you can right click on the object resource folder and click the Create option.
zh_cn: 要在游戏中创建一个物体，您可以右键单击物体资源文件夹上的，然后单击创建选项。

source: To display this page you need a browser with JavaScript support.
zh_cn: 要显示此页，您需要一个支持 JavaScript 的浏览器。

source: To distribute your game outside of the Mac App Store El Capitan requires that your game package is codesigned.
zh_cn: 在El Capitan的苹果应用商店（Mac App Store）外面发布你的游戏需要数字签名。

source: To distribute your game outside of the Mac App Store El Capitan requires that\nyour game package is codesigned.
zh_cn: 在EI Capitan 的苹果应用商店（Mac App Store）外面发布你的游戏需要数字签名。

source: To distribute your title outside of the Mac App Store macOS requires that your\npackage is codesigned.
zh_cn: 要在Mac App Store之外分发您的标题，macOS要求您的\n程序包已经过编码。

source: To do this, first create a new text document on your desktop and open it in Notepad.
zh_cn: 为此，首先在桌面上创建一个新的文本文档并在记事本中打开它。

source: To do this, simply add the following into the very first line of the code editor for the event:
zh_cn: 为此，只需将以下内容添加到事件代码编辑器的第一行：

source: To do this, we use the SHIFT operator <<.
zh_cn: 为了完成这件事，我们需要使用移位（Shift）运算符 << 。

source: To do this, you simply have to specify the array variable (no need for each of the individual entries, nor the [] brackets) and the array will be passed by reference into the script.
zh_cn: 做到这点，仅需指定指定变量数组（不需要每个入口独立传入）并作为脚本的一个参数。

source: To download any of the Official tutorials or demos, simply click on the icon for the one you wish to go through and it will added to your "Owned" section at the top (note that you may be required to login to the Marketplace before this can be done).
zh_cn: 下载任何官方教程或演示资料，只需点击其中一个图标它会自动下载到你的 "已拥有（Owned）"部分中，(注意：此前你首先需要登录到YoYo市场).

source: To ease you into things we have created a handy Quick Start Guide, and even if you are familiar with other game creation tools we recommend that you start there to get an overview of the way that GameMaker Studio 2 works.
zh_cn: 为减轻进入的难度，我们创建了一个方便的 快速入门指南，即使你熟悉其它创作工具，我们仍然建议你从这里开始了解一下 GameMaker Studio 2 工作方式的概述。

source: To find out what runtime you are on, or for information on how to add, remove or activate runtimes, please see the Runtime Preferences section.
zh_cn: 要了解您所使用的运行库，或有关如何添加，删除以及激活运行库的信息，请参阅 运行库首选项 部分。

source: To get an idea of how this would work when writing your own scripts, let's take this basic example:
zh_cn: 为了了解其在你撰写自己脚本时候的工作机理，我们来看一下这个基本的例子：

source: To get this working you must first create a Windows executable of your game and have it installed on your test machine.
zh_cn: 要使命令行参数可用，你需要创建一个 Windows 可执行游戏，并将其安装到你的测试机上。

source: To help understand how this function can be use, please look at the following few examples:
zh_cn: 为了便于理解该函数的用法，请看下面几个样例：
